vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC041_DFP.pdsc
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.Legacy_flash_adapter, driver.flash, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.Legacy_flash_adapter, driver.flash, device=MCXC041.internal_condition">
      <require condition="anyOf.allOf=component.Legacy_flash_adapter, driver.flash.internal_condition"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.Legacy_flash_adapter, driver.flash.internal_condition">
      <accept condition="allOf.component.Legacy_flash_adapter, driver.flash.internal_condition"/>
    </condition>
    <condition id="allOf.component.Legacy_flash_adapter, driver.flash.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="Legacy_flash_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.anyOf=driver.port, driver.gpio, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.port, driver.gpio, device=MCXC041.internal_condition">
      <require condition="anyOf.driver.port.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.i2c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.i2c, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.i2c, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.i2c_adapter, driver.i2c, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.i2c_adapter, driver.i2c, device=MCXC041.internal_condition">
      <require condition="anyOf.allOf=component.i2c_adapter, driver.i2c.internal_condition"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.i2c_adapter, driver.i2c.internal_condition">
      <accept condition="allOf.component.i2c_adapter, driver.i2c.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter, driver.i2c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, driver.common, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.gpio_adapter, driver.gpio, component.timer_manager, driver.common, device=MCXC041.internal_condition">
      <require condition="anyOf.allOf=component.gpio_adapter, driver.gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MCXC041.internal_condition"/>
    </condition>
