vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXC041_DFP.pdsc
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXC041.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.spi_adapter, driver.spi, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.spi_adapter, driver.spi, device=MCXC041.internal_condition">
      <require condition="anyOf.allOf=component.spi_adapter, driver.spi.internal_condition"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.spi_adapter, driver.spi.internal_condition">
      <accept condition="allOf.component.spi_adapter, driver.spi.internal_condition"/>
    </condition>
    <condition id="allOf.component.spi_adapter, driver.spi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.spi, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.spi, device=MCXC041.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm, component.lists, driver.common, device=MCXC041.internal_condition">
      <require condition="anyOf.allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXC041.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lptmr_adapter, driver.lptmr, allOf=component.tpm_adapter, driver.tpm.internal_condition">
      <accept condition="allOf.component.lptmr_adapter, driver.lptmr.internal_condition"/>
      <accept condition="allOf.component.tpm_adapter, driver.tpm.internal_condition"/>
    </condition>
    <condition id="allOf.component.lptmr_adapter, driver.lptmr.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="allOf.component.tpm_adapter, driver.tpm.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm"/>
    </condition>
    <condition id="component.tpm_adapter.condition_id">
      <require condition="allOf.driver.tpm, device=MCXC041.internal_condition"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXC041.internal_condition"/>
    </condition>
